Repository: Monicajimba123/hack4change_codesprint
Catalog: lib/l10n/app_*.arb
Languages: ne

# welcome
source: Welcome to FarmConnect
ne: FarmConnect मा स्वागत छ

# subtitle
source: Your smart agri-marketplace
ne: तपाईंको स्मार्ट कृषि बजार

source: Email
ne: इमेल

source: Password
ne: पासवर्ड

source: Select Role
ne: भूमिका चयन गर्नुहोस्

source: Login
ne: लग - इन

source: Create Account
ne: खाता सिर्जना गर्नुहोस्

source: Forgot Password
ne: पासवर्ड बिर्सनुभयो

# fillAllFields
source: Please fill all fields.
ne: कृपया सबै विवरण भर्नुहोस्।

# enterValidEmail
source: Please enter a valid Gmail address.
ne: कृपया मान्य Gmail ठेगाना प्रविष्ट गर्नुहोस्।

# passwordValidation
source: Password must be at least 8 characters.
ne: पासवर्ड कम्तिमा 8 अक्षरको हुनुपर्छ।

source: Admin
ne: प्रशासक

source: Buyer
ne: क्रेता

source: Farmer
ne: किसान

source: Unknown Farmer
ne: अज्ञात किसान

source: Unknown Supplier
ne: अज्ञात आपूर्तिकर्ता
